من كتابة استيراد ديكت ، قائمة
من كوانت.البيانات.مكونات استيراد المكونات
من كوانت.البيانات.نقابة.صوت.صوت_حالة_تحديث استيراد صوتالدولة
من كوانت.البيانات.المستخدم استيراد المستخدم
من كوانت.البيانات.نقابة.نقابة استيراد الكائنات
من كوانت.البيانات.نقابة.الرسائل.رمز تعبيري استيراد رمز تعبيري ، رد فعل
من كوانت.البيانات.نقابة.الرسائل.رسالة استيراد رسالة
من كوانت.إمبل.الأحداث.أنواع استيراد أنواع الأحداث
فئة كاشيماناجر:
        ____المخبأ _ المبرمجون={} ؛ _ _ المخبأ _ المستخدمون={} ؛ _ _ المخبأ _ الرسائل = {}؛_ _ المخبأ _ الرموز التعبيرية = {} ؛ _ _ المخبأ _ المكونات=[]
        إضافة مستخدم (أ ، مستخدم): 'يضيف المستخدم إلى ذاكرة التخزين المؤقت.'; أ._ _ مؤقتا _ المستخدمين [المستخدم.معرف المستخدم] = المستخدم
        إضافة رسالة (ب ، رسالة):'يضيف رسالة إلى ذاكرة التخزين المؤقت.'؛أ=رسالة ؛ ب._ _ الرسائل المخزنة مؤقتا [أ. معرف الرسالة] = أ
        الحالة (أ ، معرف المستخدم ، الحالة): أ.__مخبأ _ صوت _ الدول [معرف المستخدم] = الدولة
        (ب ، النقابة): 'يضيف النقابة إلى ذاكرة التخزين المؤقت.'؛أ=النقابة ؛ ب. _ _ مخبأ _ النقابات [أ. معرف النقابة] = أ
        ديف أد-إيموجي (ب ، إيموجي):
                'يضيف الرموز التعبيرية إلى ذاكرة التخزين المؤقت.'؛أ=رمز تعبيري
                إذا كان الأمر كذلك (أ ، رمز تعبيري): ب. _ _ مخبأ _ رموز تعبيرية [أ. إيموجي] = أ
                إليف إيسينستانس (أ ، رد فعل): ب. _ _ مؤقتا _ إموجيس [أ. إموجيس.إيموجي] = أ
        المكونات الإضافية (أ ، المكون): أ. _ _ المكونات المخزنة مؤقتا.إلحاق (مكون)
        الحصول على المستخدم (أ ، معرف المستخدم):'الحصول على المستخدم من ذاكرة التخزين المؤقت.'; إرجاع أ._ _ مؤقتا _ المستخدمين.الحصول على (معرف المستخدم)
        الحصول على المستخدمين (أ): 'الحصول على جميع المستخدمين المخبأة.'; قائمة العودة (أ._ _ مؤقتا _ المستخدمين.القيم())
        الحصول على رسالة (أ ، معرف الرسالة):'الحصول على رسالة من ذاكرة التخزين المؤقت.'؛إرجاع أ. _ _ الرسائل المخزنة مؤقتا.الحصول على (رسالة_معرف)
        الحصول على جميع الرسائل (أ):'الحصول على جميع الرسائل المخزنة مؤقتا.'؛قائمة الإرجاع (أ. _ _ الرسائل المخزنة مؤقتا.القيم())
        الحصول على النقابة من ذاكرة التخزين المؤقت.'؛العودة أ._ _ مؤقتا _ النقابات.احصل على (معرف النقابة)
        الحصول على جميع النقابات المخزنة مؤقتا.'; قائمة العودة (أ._ _ مؤقتا _ النقابات.القيم())
        الحصول على رمز تعبيري من ذاكرة التخزين المؤقت.'; إرجاع أ. _ _ مؤقتا _ الرموز التعبيرية.الحصول على (إيموجييد)
        الحصول على جميع الرموز التعبيرية المخزنة مؤقتا ؛ قائمة الإرجاع (أ._ _ مؤقتا _ الرموز التعبيرية.القيم())
        الحصول على المكونات (أ):'الحصول على جميع المكونات المخزنة مؤقتا' ؛ إرجاع المكونات المخزنة مؤقتا
        (أ ، معرف النقابة ، معرف المستخدم): ب = أ. احصل على (معرف النقابة) ؛ العودة [أ لـ في ب. صوت_الحالات إذا أ. معرف النقابة = = أ. معرف النقابة و أ. معرف المستخدم= = معرف المستخدم] [0]
        من الحدث (أ ، اسم الحدث، * * ب):
                مباراة الحدث_الاسم:
                        أنواع أحداث الحالة.حدث جاهز: أ. إضافة مستخدم (مستخدم (**ب ['مستخدم']))
                        أنواع أحداث الحالة.إنشاء رسالة: أ. إضافة رسالة (رسالة (**ب))
                        أنواع أحداث الحالة.النقابة:
                                ج = النقابة (**ب) ؛ أ. إضافة (ج)
                                إذا ج. عدد الأعضاء<=2000:
                                        للأعضاء: أ. إضافة مستخدم (مستخدم إلكتروني)
                                ل و في ج. إموجيس: أ. إضافة إيموجي (رموز تعبيرية (**و))
                        أنواع أحداث الحالة.النقابة _ حذف: ديل أ. _ _ مؤقتا _ النقابات [كثافة العمليات (ب ['معرف'])]
                        أنواع أحداث الحالة.صوت_حديث_تحديث:
                                د = أ. الحصول على (إنت (ب ['غيلد_يد'])) ؛ ز = فويسستات (**ب)
                                إذا لين (د. الدول الصوتية) = = 0: د. الدول الصوتية.تذييل(ز)