من كتابة استيراد أي

استيراد أترس

من كوانت.البيانات.المستخدم استيراد المستخدم
من كوانت.البيانات.بوابة.ندفة الثلج استيراد ندفة الثلج


تضمين التغريدة.تعريف
صف ويب هوك:
    <url>.حقل (الاسم المستعار= "ورل")
    <url>.الحقل (الاسم المستعار= "الرمز المميز")
    <url>.حقل (الاسم المستعار= "الصورة الرمزية")
    <url>.حقل (الاسم المستعار= "الاسم")
    دليل الويب: ندفة الثلج = أترس.حقل (الاسم المستعار= "معرف")
    النوع: إنت = أترس.الحقل (الاسم المستعار= "النوع")
    النقابة: ندفة الثلج / لا شيء = أترس.حقل (افتراضي=لا شيء)
    معرف القناة: ندفة الثلج | لا شيء = أترس.حقل (افتراضي=لا شيء)
    المستخدم: المستخدم / لا شيء = أترس.حقل (افتراضي=لا شيء)
    التطبيق: ندفة الثلج / لا شيء = أترس.حقل (افتراضي=لا شيء)
    المصدر: أي | لا شيء = أترس.حقل (افتراضي=لا شيء)
    قناة المصدر: أي / لا شيء = أترس.حقل (افتراضي=لا شيء)